In [2]:
import pandas as pd

In [1]:
marks = {'a':90, 'b':80, 'c':75, 'd':70}
grades = {'a':4, 'b':3, 'c':2, 'd':1}

In [3]:
results = pd.DataFrame({'marks':marks, 'grades':grades})

In [4]:
results

   marks  grades
a     90       4
b     80       3
c     75       2
d     70       1

In [5]:
results.T

         a   b   c   d
marks   90  80  75  70
grades   4   3   2   1

In [6]:
results.values

array([[90,  4],
       [80,  3],
       [75,  2],
       [70,  1]])

In [7]:
results.columns

Index(['marks', 'grades'], dtype='object')

In [8]:
results.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
results['scaled'] = 90 * (results['marks']/100)

In [12]:
results

   marks  grades  scaled
a     90       4    81.0
b     80       3    72.0
c     75       2    67.5
d     70       1    63.0

In [15]:
b = pd.DataFrame([{'a':1, 'b':2}, {'b':2, 'c':4}])

In [16]:
b

     a  b    c
0  1.0  2  NaN
1  NaN  2  4.0

In [18]:
b.fillna(0)

     a  b    c
0  1.0  2  0.0
1  0.0  2  4.0

In [19]:
b.T

     0    1
a  1.0  NaN
b  2.0  2.0
c  NaN  4.0

In [20]:
b.dropna

<bound method DataFrame.dropna of      a  b    c
0  1.0  2  NaN
1  NaN  2  4.0>